---
kind: type
id: T:Autodesk.Revit.DB.DirectShapeTargetViewType
source: html/1c5cd94e-3804-54da-73af-505655b0948f.htm
---
# Autodesk.Revit.DB.DirectShapeTargetViewType

View types for which DirectShape objects are allowed to have alternative shape representations

## Syntax (C#)
```csharp
public enum DirectShapeTargetViewType
```